# Pandas Exercise Examples

## Example 1

"""
The following data contains the courses and grades for 5 students. Please complete the following 3 tasks: 
1) Calculate the total score and average score for each student.
2) Identify the students whose Math score is higher than 90 OR whose English score is higher than 85.
3) Sort the total scores in descending order (highest to lowest) and list the names of the top 3 students.

data = {
    "name":["John","Alice","Nick","Tom","Kate"],
    "math":[85,92,78,88,95],
    "english":[90,88,85,92,80],
    "physics":[75,80,88,85,90]    
}

"""

In [1]:
import pandas as pd
data = {
    "name":["John","Alice","Nick","Tom","Kate"],
    "math":[85,92,78,88,95],
    "english":[90,88,85,92,80],
    "physics":[75,80,88,85,90]
}

In [2]:
df1 = pd.DataFrame(data) #generate a dataframe (named as df1 here) 
df1

    name  math  english  physics
0   John    85       90       75
1  Alice    92       88       80
2   Nick    78       85       88
3    Tom    88       92       85
4   Kate    95       80       90

### Task 1) - Calculate the total score and average score for each student.

In [3]:
df1[["math","english","physics"]].sum(axis=1)

df1["total"] = df1[["math","english","physics"]].sum(axis=1) #axis=1 along the row direction
df1["average"] = df1[["math","english","physics"]].mean(axis=1)
df1

    name  math  english  physics  total    average
0   John    85       90       75    250  83.333333
1  Alice    92       88       80    260  86.666667
2   Nick    78       85       88    251  83.666667
3    Tom    88       92       85    265  88.333333
4   Kate    95       80       90    265  88.333333

In [4]:
print(df1[["name","total","average"]])

    name  total    average
0   John    250  83.333333
1  Alice    260  86.666667
2   Nick    251  83.666667
3    Tom    265  88.333333
4   Kate    265  88.333333

### Task 2) - Identify the students whose Math score is higher than 90 OR whose English score is higher than 85.

In [5]:
filter1 = (df1.math>90) | (df1.english >85) 
df1.loc[filter1]

    name  math  english  physics  total    average
0   John    85       90       75    250  83.333333
1  Alice    92       88       80    260  86.666667
3    Tom    88       92       85    265  88.333333
4   Kate    95       80       90    265  88.333333

In [6]:
df1.loc[filter1]["name"]

0     John
1    Alice
3      Tom
4     Kate
Name: name, dtype: object

In [7]:
print("students whose Math score is higher than 90 OR whose English score is higher than 85: ")
print(df1.loc[filter1]["name"].to_list())

students whose Math score is higher than 90 OR whose English score is higher than 85:
['John', 'Alice', 'Tom', 'Kate']

### Task 3) - Sort the total scores in descending order (highest to lowest) and list the names of the top 3 students.

In [8]:
#method 1: sort 
df1.sort_values(by="total",ascending=False)

    name  math  english  physics  total    average
4   Kate    95       80       90    265  88.333333
3    Tom    88       92       85    265  88.333333
1  Alice    92       88       80    260  86.666667
2   Nick    78       85       88    251  83.666667
0   John    85       90       75    250  83.333333

In [9]:
#method 1: find the top 3: 
df1.sort_values(by="total",ascending=False).head(3).name

4     Kate
3      Tom
1    Alice
Name: name, dtype: object

In [10]:
#method 2: sort + find using nlargest()

df1.nlargest(len(df1),"total")

    name  math  english  physics  total    average
4   Kate    95       80       90    265  88.333333
3    Tom    88       92       85    265  88.333333
1  Alice    92       88       80    260  86.666667
2   Nick    78       85       88    251  83.666667
0   John    85       90       75    250  83.333333

In [11]:
#method 2: - select the top 3 
df1.nlargest(len(df1),"total")[0:3][["name","total"]]   #[0:3] functions similarly to head(3)

    name  total
4   Kate    265
3    Tom    265
1  Alice    260

In [12]:
sorted_df1 = df1.nlargest(len(df1),"total")
top3_name = df1.nlargest(len(df1),"total")[0:3][["name","total"]].name.to_list()
print("sorted data with descending order: ")
print(sorted_df1)
print()
print("top3_name:" , "\n", top3_name)

sorted data with descending order:
    name  math  english  physics  total    average
4   Kate    95       80       90    265  88.333333
3    Tom    88       92       85    265  88.333333
1  Alice    92       88       80    260  86.666667
2   Nick    78       85       88    251  83.666667
0   John    85       90       75    250  83.333333

top3_name:
 ['Kate', 'Tom', 'Alice']